Repository: Team-Saucisse/EnergyHack
Catalog: TheSaucisseFactory/TheSaucisseFactory.Administration/App_GlobalResources/WebResources.*.resx
Languages: fr

source: About
fr: A Propos

source: Register
fr: Inscription

source: Login
fr: Connexion

source: Add New
fr: NOUVEAU

source: Modify
fr: Modifier

source: View
fr: Visualiser

source: Choose Form
fr: Formulaire

source: Provided By
fr: Proposé par

source: all rights reserved
fr: tous droits réservés

source: Select View ...
fr: Choisir Vue ...

# SelectForm
source: Choose Form
fr: Choisir Formulaire

source: Method Results
fr: Résultat de la méthode

# CFEGenerated
source: This site was generated with CodeFluent Entities on {0:F}.
fr: Ce site a été généré par CodeFluent Entities {0:F}.

# CFEGenerated2
source: Generated on {0:F}.
fr: Genéré {0:F}.

source: Return To Previous Page
fr: Revenir à la page précédente

source: Choose a File To Upload
fr: Choisir un fichier à télécharger

source: Existing blob preview:
fr: Aperçu de Blob existant:

# NewBlobPreview
source: Blob has been uploaded. New preview:
fr: Le Blob a été téléchargé. Nouvel aperçu:

source: Blob Upload
fr: Téléchargement de Blob

# BlobUploadError
source: An error has occured trying to upload the file.
fr: Une erreur est survenue lors du téléchargement du fichier.

# BlobDownloadError
source: An error has occured trying to download the file.
fr: Une erreur est survenue lors du téléchargement du fichier.

# NamespaceEntities
source: This namespace contains the following entities
fr: Cet espace de nom contient les entités suivantes

# EntityLayout
source: Layout
fr: Définition

source: - Management Page
fr: - Page de Gestion

source: Home
fr: Accueil

source: Views
fr: Vues

# EntityPresentation
source: <p> This page allows an end user to create a new instance of the <i>{0}</i> type, or browse the database for already saved instances: </p> <ul> <li><b>Create a new <i>{0}</i> instance</b>: Using the first hyperlink visible to the left side of this page, you can create a new instance of the {0} entity. </li> <li><b>Load existing <i>{0}</i> instances</b>: Using one of the hyperlinks to the left side of this page, you can load instances of the {0} entity. Some methods have parameters, other are parameterless. </li> <li><b>Delete existing <i>{0}</i> instances</b>: Once an instance has been loaded from the database using one of the methods on the left side of this page, the end user will be able to delete it, if it is authorized. </li> <li><b>Call custom methods on the <i>{0}</i> type</b>: Any type of method can be defined on an entity, not only load, save or delete methods. </li> </ul>
fr: <p> Cette page permet à un utilisateur de créer une nouvelle instance du type <i>{0}</i>, ou de parcourir les instances existantes déjà stockées dans la base de données: </p> <ul> <li><b>Ajout d'une nouvelle instance de type <i>{0}</i> </b>: En utilisant le premier hyperlien visible à la gauche de cette page, vous pouvez créer une nouvelle instance de l'entité {0}. </li> <li><b>Chargement d'instances de type <i>{0}</i> existantes </b>: En utilisant un des hyperliens visible à la gauche de cette page, vous pouvez charger et afficher des instances de l'entité {0}. Certaines méthodes requièrent des paramètres, d'autres pas. </li> <li><b>Suppression d'une instance de type <i>{0}</i> </b>: Les instances chargées à partir de la base de données, à l'aide d'une des méthodes disponibles sur la partie gauche de cette page, peuvent être supprimées, si les règles métiers l'autorisent. </li> <li><b>Appel de méthodes spécifiques du type <i>{0}</i> </b>: Tous les types de méthodes pris en charge par CodeFluent Entities peuvent être utilisées par cette application, et pas uniquement les méthodes de type chargement, sauvegarde ou suppression. </li> </ul>

# EntityPresentation2
source: <table cellspacing="0" cellpadding="0" class="type_design"> <tr> <td><img alt="{0} Type" class="type_design" src="{1}" /></td> <td style="padding-left:20px">Here are some of the concepts used to build an entity such as the <i>{0}</i> type:<ul> <li><b>Properties</b>: Each entity is defined by a set of properties. By default, properties are persistent but you can declare computed properties whose values are dynamically computed using custom code. </li> <li><b>Relations</b>: Relations are defined as properties. Several relationship types between entities are possible, such as inheritance, association and composition, one-to-many, one-to-one, many-to-one and many-to-many. </li> <li><b>Instances</b>: Instances can be defined for each entity in the model. An instance is a collection of values, each value corresponding to a property. This feature is very useful when developers want to initialize specific tables with data. </li> <li><b>Methods</b>: CodeFluent Entities - through this method concept - allows to go way further than CRUD methods. It allows architects and developers to define methods that will be available in all generated layers. Defining them in the model results in adding platform independent methods to the meta-model, which then will be interpreted by each producer to produce platform specific and optimized code. Note: the entity layout image on the left only presents user-defined methods. Methods automatically inferred at production time are not represented. </li> <li><b>Rules</b>: The rule concept in CodeFluent Entities embraces a broad set of automatic behavior implementations. There are lifecycle rules, transaction rules, validation rules, custom (written by the developer), and rules implemented in external engines. Rules can apply on various concepts such as entities, properties, methods, or the whole project. </li> <li><b>Views</b>: The view concept in CodeFluent Entities englobes two distinct concepts: a global modeling concept, and a persistence oriented concept. From a view, persistence layer producers will produce an SQL view, whereas graphic user interface producers will define for example the list of columns when displaying instances of an entity in a grid control. </li> </ul></td> </tr> </table>
fr: <table cellspacing="0" cellpadding="0" class="type_design"> <tr> <td><img alt="{0} Type" class="type_design" src="{1}" /></td> <td style="padding-left:20px">Voici quelques uns des concepts utilisés pour définir une entité telle que <i>{0}</i> :<ul> <li><b>Propriétés</b>: Chaque entité est définie notamment par un ensemble de propriétés. Par défaut, les propriétés sont persistantes mais il est aussi possible de déclarer des propriétés calculées dont les valeurs seront dynamiquement déterminées par du code spécifique écrit par le développeur. </li> <li><b>Relations</b>: Les relations entre entités sont définies simplement commes des propriétés. Différents types de relations sont pris en charge par le produit, telles que l'héritage, l'association, la composition et les cardinalités 1:M, 1:1 symmétrique, M:1 et M:N. </li> <li><b>Instances</b>: Des instances pré-définies peuvent être déclarées pour toute entité du modèle. Une instance est une liste de valeurs, chaque valeur correspondant à une propriété de l'entité. Cette fonction est très pratique par example pour permettre aux développeurs l'initialisation des tables correspondantes aux entités ou à des fins de tests. </li> <li><b>Méthodes</b>: CodeFluent Entities - à travers le concept de méthode - permet d'aller beaucoup plus loin que les méthodes dites "CRUD" (Create/Read/Update/Delete). Les architectes et développeurs peuvent définir des méthodes spécifiques dans un langage simple qui seront disponibles dans toutes les couches de l'application. Les définir de manière indépendante de la plateforme au niveau du modèle n'empêche pas chaque producteur de code de générer du source spécifique et optimisé par rapport à la plateforme qu'il cible. Note: l'image de définition de l'entité à gauche ne présente que les méthodes écrite par l'utilisateur, et non les méthodes automatiquement inferrées automatiquement à la production. </li> <li><b>Règles de gestion</b>: Le concept de règle de gestion dans CodeFluent Entities est très large et permet une implémentation automatique et mécanique d'un certain nombre de comportements répétitifs. On trouve des règles de cycle de vie, de transaction, de validation, spécifiques (écrites par le développeur), ainsi que la prise en charge de règles implémentées par des moteurs externes. Ces règles peuvent être appliquées sur les concepts d'entité, de propriété, de méthode, ou globalement sur l'ensemble du projet. </li> <li><b>Vues</b>: Le concept de vue dans CodeFluent Entities englobe deux concepts distincts: un concept global, orienté essentiellement vers la représentation d'une instance visuellement (par des grilles par exemple), et un concept lié à la persistance, éventuellement pris en charge par la base de données cible. D'une vue, les producteurs de persistence seront donc éventuellement capable de générer une vue SQL, alors que les producteurs d'interface graphique seront capable de définir une liste de colonnes à afficher pour la réprésentation d'une instance d'une entité. </li> </ul></td> </tr> </table>

source: No editable data
fr: Aucune données éditable

# ConfirmEntityDelete
source: Confirm delete permanently this item ?
fr: Confirmez-vous la suppression définitive de cet élément ?

# CurrentPage
source: Page {0} of {1}
fr: Page {0} sur {1}

# SearchByNameWaterMark
source: Text to search...
fr: Texte à rechercher...

# DeleteNotAllowed
source: This item can't be deleted because it referenced by other items.
fr: La suppression de cet élément n'est pas autorisée car il est encore référencé par d'autres éléments.

# GoBack
source: Back
fr: Retour

source: Save
fr: Sauvegarder

source: Search
fr: Rechercher

# DBErrorDeleteItem
source: Error while deleting this item from database.
fr: Erreur lors de la suppression en base de données

# ImageWeightSizeNotCorrect
source: Image weight and/or size are not correct
fr: Le poids et/ou la taille de l'image ne sont pas corrects

# ErrorDuplicateItem
source: An item with the same data already exists in the application.
fr: Un élément avec les mêmes données existe déjà dans l'application.

# Latitude
source: The field Latitude must be between -90 and 90.
fr: Le champ Latidude doit être compris entre -90 et 90.

# Longitude
source: The field Longitude must be between -180 and 180.
fr: Le champ Longitude doit être compris entre -180 et 180.

# Produit
source: The Sous-marché field is required.
fr: Le champ Sous-marché est requis.

# UO
source: The UO attributaire du marché field is required.
fr: Le champ UO attributaire du marché est requis.

# DeleteUser
source: You can not delete your own account.
fr: Vous ne pouvez pas supprimer votre propre compte.

# Miniature
source: The miniature field is required.
fr: Le champ Miniature est requis.

# ErrorMedia
source: The miniature is identical to one of the pictures.
fr: La miniature est identique à l'une des photos.
